Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1064dal176.h
#define _ODCK_ODCK0_POSITION                     0x00000000
#define _ODCK_ODCK0_MASK                         0x00000001
#define _ODCK_ODCK0_LENGTH                       0x00000001

#define _ODCK_ODCK1_POSITION                     0x00000001
#define _ODCK_ODCK1_MASK                         0x00000002
#define _ODCK_ODCK1_LENGTH                       0x00000001

#define _ODCK_ODCK2_POSITION                     0x00000002
#define _ODCK_ODCK2_MASK                         0x00000004
#define _ODCK_ODCK2_LENGTH                       0x00000001

#define _ODCK_ODCK3_POSITION                     0x00000003
#define _ODCK_ODCK3_MASK                         0x00000008
#define _ODCK_ODCK3_LENGTH                       0x00000001

#define _ODCK_ODCK4_POSITION                     0x00000004
#define _ODCK_ODCK4_MASK                         0x00000010
#define _ODCK_ODCK4_LENGTH                       0x00000001

#define _ODCK_ODCK5_POSITION                     0x00000005
#define _ODCK_ODCK5_MASK                         0x00000020
#define _ODCK_ODCK5_LENGTH                       0x00000001

#define _ODCK_ODCK6_POSITION                     0x00000006
#define _ODCK_ODCK6_MASK                         0x00000040
#define _ODCK_ODCK6_LENGTH                       0x00000001

#define _ODCK_ODCK7_POSITION                     0x00000007
#define _ODCK_ODCK7_MASK                         0x00000080
#define _ODCK_ODCK7_LENGTH                       0x00000001

#define _ODCK_w_POSITION                         0x00000000
#define _ODCK_w_MASK                             0xFFFFFFFF
#define _ODCK_w_LENGTH                           0x00000020

#define _CNPUK_CNPUK0_POSITION                   0x00000000
#define _CNPUK_CNPUK0_MASK                       0x00000001
#define _CNPUK_CNPUK0_LENGTH                     0x00000001

#define _CNPUK_CNPUK1_POSITION                   0x00000001
#define _CNPUK_CNPUK1_MASK                       0x00000002
#define _CNPUK_CNPUK1_LENGTH                     0x00000001

#define _CNPUK_CNPUK2_POSITION                   0x00000002
#define _CNPUK_CNPUK2_MASK                       0x00000004
#define _CNPUK_CNPUK2_LENGTH                     0x00000001

#define _CNPUK_CNPUK3_POSITION                   0x00000003
#define _CNPUK_CNPUK3_MASK                       0x00000008
#define _CNPUK_CNPUK3_LENGTH                     0x00000001

#define _CNPUK_CNPUK4_POSITION                   0x00000004
#define _CNPUK_CNPUK4_MASK                       0x00000010
#define _CNPUK_CNPUK4_LENGTH                     0x00000001

#define _CNPUK_CNPUK5_POSITION                   0x00000005
#define _CNPUK_CNPUK5_MASK                       0x00000020
#define _CNPUK_CNPUK5_LENGTH                     0x00000001

#define _CNPUK_CNPUK6_POSITION                   0x00000006
#define _CNPUK_CNPUK6_MASK                       0x00000040
#define _CNPUK_CNPUK6_LENGTH                     0x00000001

#define _CNPUK_CNPUK7_POSITION                   0x00000007
#define _CNPUK_CNPUK7_MASK                       0x00000080
#define _CNPUK_CNPUK7_LENGTH                     0x00000001

#define _CNPUK_w_POSITION                        0x00000000
#define _CNPUK_w_MASK                            0xFFFFFFFF
#define _CNPUK_w_LENGTH                          0x00000020

#define _CNPDK_CNPDK0_POSITION                   0x00000000
#define _CNPDK_CNPDK0_MASK                       0x00000001
#define _CNPDK_CNPDK0_LENGTH                     0x00000001

#define _CNPDK_CNPDK1_POSITION                   0x00000001
#define _CNPDK_CNPDK1_MASK                       0x00000002
#define _CNPDK_CNPDK1_LENGTH                     0x00000001

#define _CNPDK_CNPDK2_POSITION                   0x00000002
#define _CNPDK_CNPDK2_MASK                       0x00000004
#define _CNPDK_CNPDK2_LENGTH                     0x00000001

#define _CNPDK_CNPDK3_POSITION                   0x00000003
#define _CNPDK_CNPDK3_MASK                       0x00000008
#define _CNPDK_CNPDK3_LENGTH                     0x00000001

#define _CNPDK_CNPDK4_POSITION                   0x00000004
#define _CNPDK_CNPDK4_MASK                       0x00000010
#define _CNPDK_CNPDK4_LENGTH                     0x00000001

#define _CNPDK_CNPDK5_POSITION                   0x00000005
#define _CNPDK_CNPDK5_MASK                       0x00000020
#define _CNPDK_CNPDK5_LENGTH                     0x00000001

#define _CNPDK_CNPDK6_POSITION                   0x00000006
#define _CNPDK_CNPDK6_MASK                       0x00000040
#define _CNPDK_CNPDK6_LENGTH                     0x00000001

#define _CNPDK_CNPDK7_POSITION                   0x00000007
#define _CNPDK_CNPDK7_MASK                       0x00000080
#define _CNPDK_CNPDK7_LENGTH                     0x00000001

#define _CNPDK_w_POSITION                        0x00000000
#define _CNPDK_w_MASK                            0xFFFFFFFF
#define _CNPDK_w_LENGTH                          0x00000020

#define _CNCONK_EDGEDETECT_POSITION              0x0000000B
#define _CNCONK_EDGEDETECT_MASK                  0x00000800
#define _CNCONK_EDGEDETECT_LENGTH                0x00000001

#define _CNCONK_ON_POSITION                      0x0000000F
#define _CNCONK_ON_MASK                          0x00008000
#define _CNCONK_ON_LENGTH                        0x00000001

#define _CNCONK_w_POSITION                       0x00000000
#define _CNCONK_w_MASK                           0xFFFFFFFF
#define _CNCONK_w_LENGTH                         0x00000020

#define _CNENK_CNIEK0_POSITION                   0x00000000
#define _CNENK_CNIEK0_MASK                       0x00000001
#define _CNENK_CNIEK0_LENGTH                     0x00000001

#define _CNENK_CNIEK1_POSITION                   0x00000001
#define _CNENK_CNIEK1_MASK                       0x00000002
#define _CNENK_CNIEK1_LENGTH                     0x00000001

#define _CNENK_CNIEK2_POSITION                   0x00000002
#define _CNENK_CNIEK2_MASK                       0x00000004
#define _CNENK_CNIEK2_LENGTH                     0x00000001

#define _CNENK_CNIEK3_POSITION                   0x00000003
#define _CNENK_CNIEK3_MASK                       0x00000008
#define _CNENK_CNIEK3_LENGTH                     0x00000001

#define _CNENK_CNIEK4_POSITION                   0x00000004
#define _CNENK_CNIEK4_MASK                       0x00000010
#define _CNENK_CNIEK4_LENGTH                     0x00000001

